{
  "terms": {
    "title": "Terms & Conditions",
    "lastUpdated": "July 6, 2025",
    "sections": [
      {
        "title": "1. Introduction",
        "content": "These Terms & Conditions ('Terms') govern your use of alltripp.com ('Website') and all services provided by AllTripp Tours & Travels ('we', 'our', 'us'). By accessing the Website or booking our services, you agree to be bound by these Terms. If you do not agree with any part of these terms, you must not use our Website or services."
      },
      {
        "title": "2. Services Overview",
        "content": "We are a travel facilitator, offering services such as booking flights, hotels, and transportation; organizing guided tours and activities; and providing travel assistance. We partner with third-party suppliers (e.g., airlines, hotels, tour operators). Your booking is subject to the terms and conditions of these third-party suppliers."
      },
      {
        "title": "3. Booking and Payment",
        "content": "To make a booking, you must provide accurate and complete information. A deposit or full payment may be required at the time of booking. Prices are subject to change until the booking is confirmed. We accept various payment methods, which will be specified at the time of booking."
      },
      {
        "title": "4. User Responsibilities",
        "content": "You are responsible for ensuring that you have valid passports, visas, and any other required travel documents. You must also comply with all health and safety regulations. It is your responsibility to arrive on time for all departures and activities. Any disruptive behavior may result in termination of your trip without a refund."
      },
      {
        "title": "5. Limitation of Liability",
        "content": "Our liability is limited to the total amount you paid for the service. We are not liable for any indirect or consequential damages, or for any loss or damage caused by third-party suppliers. We are not responsible for events outside our control, such as natural disasters, strikes, or political unrest (Force Majeure)."
      },
      {
        "title": "6. Intellectual Property",
        "content": "All content on our Website, including text, images, and logos, is the property of AllTripp or its licensors and is protected by copyright and trademark laws. You may not use any content from our Website without our prior written permission."
      },
      {
        "title": "7. Governing Law and Dispute Resolution",
        "content": "These Terms are governed by the laws of India. Any disputes arising from these Terms will be subject to the exclusive jurisdiction of the courts in Delhi, India."
      },
      {
        "title": "8. Changes to These Terms",
        "content": "We reserve the right to update these Terms at any time. Any changes will be posted on our Website, and your continued use of our services after such changes constitutes your acceptance of the new Terms."
      }
    ]
  },
  "refund": {
    "title": "Refund & Cancellation Policy",
    "lastUpdated": "July 6, 2025",
    "sections": [
      {
        "title": "1. Cancellation by You",
        "content": "If you wish to cancel your booking, you must notify us in writing. The following cancellation fees apply: \n- 30 days or more before departure: Full refund minus a 10% processing fee. \n- 15-29 days before departure: 50% refund. \n- Less than 15 days before departure: No refund. \nCertain bookings may be non-refundable; this will be specified at the time of booking."
      },
      {
        "title": "2. Cancellation by Us",
        "content": "We reserve the right to cancel your booking for reasons such as safety concerns, insufficient demand, or other unforeseen circumstances. In such cases, we will offer you the choice of a full refund or an alternative trip of equivalent value."
      },
      {
        "title": "3. Refund Process",
        "content": "Refunds will be processed within 7-10 business days of the cancellation confirmation. All refunds will be credited to the original method of payment. Please note that it may take additional time for the refund to appear on your statement, depending on your bank."
      },
      {
        "title": "4. Non-Refundable Items",
        "content": "Certain items are non-refundable, including but not limited to: \n- Flights and other transportation tickets, unless otherwise specified. \n- Travel insurance premiums. \n- Booking and processing fees. \n- Any services already used."
      },
      {
        "title": "5. Contact Information",
        "content": "For any questions regarding our refund and cancellation policy, please contact us at refund@alltripp.com or call us at +91-9266602470."
      }
    ]
  },
  "privacy": "Terms and conditions: \n\n1. Introduction\nThese Terms & Conditions (“Terms”) apply to your access to and use of alltripp.com (“Website”) and any services provided by AllTripp Tours & Travels (“we”, “our”, “us”). By using the Website or booking services, you agree to these Terms. If you don’t agree, please do not use our Website or services.\n\n2. Services Overview\nWe act as travel facilitators, offering services like:\n\nBooking flights, hotels, or transfers\n\nGuided tours, excursions, and activity packages\n\nTravel insurance, visa assistance (where available)\n\nWe collaborate with third-party suppliers (airlines, hotels, guides, etc.). You acknowledge that each supplier’s terms apply to your booking.\n\n3. Booking & Payment\nReservation Process: You submit your booking request, we confirm availability and price, and you pay the required deposit or full amount.\n\nPayment: We accept major credit/debit cards, bank transfers, and other eligible payment methods. All payments are handled securely.\n\nPricing: All prices are in INR (unless specified) and include taxes/fees unless noted otherwise. We reserve the right to correct errors or adjust prices before confirmation.\n\nConfirmation & Invoices: Booking confirmation and official invoices are sent via email.\n\n4. Cancellation & Refunds\nYour Cancellations: Subject to the supplier’s terms. Cancellation fees may apply.\n\nOur Cancellations: We may cancel due to unforeseen issues (insufficient bookings, force majeure, supplier changes). If canceled by us, you may choose between a refund or rescheduling.\n\nRefunds: Issued within 14 business days after cancellations are processed, minus applicable fees.\n\n5. Changes by You or Us\nBy You: Modifications (dates, travelers, itinerary) may incur fees based on supplier policies.\n\nBy Us: If significant changes occur (e.g., schedule, price, accommodation) we’ll notify and offer an alternative, refund, or rescheduling option.\n\n6. Travel Documents & Identification\nYou are responsible for obtaining valid passports, visas, ID, health documentation (e.g., vaccinations or tests), and travel insurance. We are not liable for penalties or denials arising from missing or invalid documents.\n\n7. Health, Safety & Conduct\nYou must comply with local laws, regulations, customs, and safety rules. We reserve the right to prevent or remove participants for disruptive behavior or safety risks (without a refund).\n\n8. Liability & Disclaimers\nLiability Limit: To the fullest allowed by law, our liability is limited to the total amount you paid. We are not responsible for indirect damages like lost enjoyment or missed connections.\n\nThird-party Providers: We do not guarantee third-party services (e.g., airlines, hotels, local operators). You must claim directly with them for issues.\n\nForce Majeure: We are not liable for events outside our control (e.g., natural disasters, strikes, COVID‑19, terrorism, political unrest, delays from transport providers).\n\n9. Insurance\nComprehensive travel insurance is strongly recommended. We may require proof of cover before certain services (e.g. adventure tours). Insurance claims must be filed with the insurance provider.\n\n10. Intellectual Property\nAll website content, trademarks, and logos belong to AllTripp or its licensors. You may not copy, distribute, modify, or use without written permission.\n\n11. Privacy\nOur Privacy Policy (available separately) explains how we collect, use, and protect your personal data. These Terms incorporate the Privacy Policy by reference.\n\n12. Dispute Resolution & Governing Law\nLaw: Governed by the laws of [Your State/India], without conflict-of-law principles.\n\nDispute Resolution: Parties shall try informal resolution. If unsuccessful, disputes will be subject to the exclusive jurisdiction of [designated courts in your jurisdiction].\n\nArbitration (Optional): Disputes may be resolved through arbitration under [specified arbitration rules].\n\n13. Changes to These Terms\nWe may update these Terms (e.g. feature changes, legal updates). We’ll note the effective date above. Continued use after updates indicates acceptance.\n\n14. Contact Information\nQuestions about these Terms? Please reach out:\n\nEmail: alltrippofficial@gmail.com\n\nPhone:9266602470\n\nAddress: House No 404, Adarsh Kunj, Najafgarh, South West District, Delhi – 110043\n\n15. Acknowledgment\nBy using the Website or booking services, you confirm you:\n\nHave read, understood, and accepted these Terms\n\nHave the legal capacity to enter into these Terms\n\nAccept financial responsibility for bookings made under your account"
}
