{
  "terms": {
    "title": "Terms & Conditions",
    "lastUpdated": "July 6, 2025",
    "sections": [
      {
        "title": "1. Introduction",
        "content": "These Terms & Conditions ('Terms') govern your use of alltripp.com ('Website') and all services provided by AllTripp Tours & Travels ('we', 'our', 'us'). By accessing the Website or booking our services, you agree to be bound by these Terms. If you do not agree with any part of these terms, you must not use our Website or services."
      },
      {
        "title": "2. Services Overview",
        "content": "We are a travel facilitator, offering services such as booking flights, hotels, and transportation; organizing guided tours and activities; and providing travel assistance. We partner with third-party suppliers (e.g., airlines, hotels, tour operators). Your booking is subject to the terms and conditions of these third-party suppliers."
      },
      {
        "title": "3. Booking and Payment",
        "content": "To make a booking, you must provide accurate and complete information. A deposit or full payment may be required at the time of booking. Prices are subject to change until the booking is confirmed. We accept various payment methods, which will be specified at the time of booking."
      },
      {
        "title": "4. User Responsibilities",
        "content": "You are responsible for ensuring that you have valid passports, visas, and any other required travel documents. You must also comply with all health and safety regulations. It is your responsibility to arrive on time for all departures and activities. Any disruptive behavior may result in termination of your trip without a refund."
      },
      {
        "title": "5. Limitation of Liability",
        "content": "Our liability is limited to the total amount you paid for the service. We are not liable for any indirect or consequential damages, or for any loss or damage caused by third-party suppliers. We are not responsible for events outside our control, such as natural disasters, strikes, or political unrest (Force Majeure)."
      },
      {
        "title": "6. Intellectual Property",
        "content": "All content on our Website, including text, images, and logos, is the property of AllTripp or its licensors and is protected by copyright and trademark laws. You may not use any content from our Website without our prior written permission."
      },
      {
        "title": "7. Governing Law and Dispute Resolution",
        "content": "These Terms are governed by the laws of India. Any disputes arising from these Terms will be subject to the exclusive jurisdiction of the courts in Delhi, India."
      },
      {
        "title": "8. Changes to These Terms",
        "content": "We reserve the right to update these Terms at any time. Any changes will be posted on our Website, and your continued use of our services after such changes constitutes your acceptance of the new Terms."
      }
    ]
  },
  "refund": {
    "title": "Refund & Cancellation Policy",
    "lastUpdated": "July 6, 2025",
    "sections": [
      {
        "title": "1. Cancellation by You",
        "content": "If you wish to cancel your booking, you must notify us in writing. The following cancellation fees apply: \n- 30 days or more before departure: Full refund minus a 10% processing fee. \n- 15-29 days before departure: 50% refund. \n- Less than 15 days before departure: No refund. \nCertain bookings may be non-refundable; this will be specified at the time of booking."
      },
      {
        "title": "2. Cancellation by Us",
        "content": "We reserve the right to cancel your booking for reasons such as safety concerns, insufficient demand, or other unforeseen circumstances. In such cases, we will offer you the choice of a full refund or an alternative trip of equivalent value."
      },
      {
        "title": "3. Refund Process",
        "content": "Refunds will be processed within 7-10 business days of the cancellation confirmation. All refunds will be credited to the original method of payment. Please note that it may take additional time for the refund to appear on your statement, depending on your bank."
      },
      {
        "title": "4. Non-Refundable Items",
        "content": "Certain items are non-refundable, including but not limited to: \n- Flights and other transportation tickets, unless otherwise specified. \n- Travel insurance premiums. \n- Booking and processing fees. \n- Any services already used."
      },
      {
        "title": "5. Contact Information",
        "content": "For any questions regarding our refund and cancellation policy, please contact us at refund@alltripp.com or call us at +91-9266602470."
      }
    ]
  },
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "July 6, 2025",
    "sections": [
      {
        "title": "1. Introduction",
        "content": "This Privacy Policy explains how AllTripp Tours & Travels ('we', 'our', 'us') collects, uses, and protects your personal information when you use our Website and services. We are committed to protecting your privacy and ensuring that your personal information is handled in a safe and responsible manner."
      },
      {
        "title": "2. Information We Collect",
        "content": "We may collect the following types of personal information: \n- Contact information, such as your name, email address, phone number, and mailing address. \n- Booking information, such as your travel dates, destination, and payment details. \n- Passport and visa information. \n- Any other information you provide to us when you make a booking or contact us for support."
      },
      {
        "title": "3. How We Use Your Information",
        "content": "We use your personal information to: \n- Process your bookings and payments. \n- Communicate with you about your bookings and provide customer support. \n- Send you marketing communications, if you have opted in to receive them. \n- Improve our Website and services."
      },
      {
        "title": "4. How We Protect Your Information",
        "content": "We use a variety of security measures to protect your personal information, including encryption and secure servers. We restrict access to your personal information to authorized employees and third-party service providers who need to know the information to provide our services."
      },
      {
        "title": "5. Sharing Your Information",
        "content": "We may share your personal information with third-party service providers, such as airlines, hotels, and tour operators, to fulfill your booking. We will not sell or rent your personal information to third parties for their marketing purposes without your explicit consent."
      },
      {
        "title": "6. Your Rights",
        "content": "You have the right to access, correct, or delete your personal information at any time. You can also object to the processing of your personal information or request that we restrict the processing of your personal information. To exercise these rights, please contact us at privacy@alltripp.com."
      },
      {
        "title": "7. Cookies",
        "content": "Our Website uses cookies to improve your browsing experience. You can choose to disable cookies in your browser settings, but this may affect the functionality of our Website."
      },
      {
        "title": "8. Changes to This Privacy Policy",
        "content": "We may update this Privacy Policy from time to time. Any changes will be posted on our Website, and your continued use of our services after such changes constitutes your acceptance of the new Privacy Policy."
      }
    ]
  }
}
